export const solfa = ["do", "re", "mi", "fa", "sol", "la", "si"];
export const homophone = ["哆", "来", "咪", "发", "所", "啦", "西"];
export const songs = {
  song1: `N: #1e, (2d,(b3,4)), 5, 6.|`,
  song2: `N: X X (XX) X | (XX) (XX) X 0 | (XX) (XX) (XX) X | (XX) (XX) X 0 |
  Lc[1.]: 门前大桥下，游过一群鸭。快来快来数一数，二四六七八。
  ---
  N: &lpr; (1e.(1eee)) (5ddd5) (36) (53) | (21) (23) 1 - &rpr; |
  ---
  N: 3 1 (33) 1 | (33) (56) 5 - | (66) (65) (44) 4 | (23) (21) 2 - |
  Lc[1.]: 门前大桥下，游过一群鸭。快来快来数一数，二四六七八。
  Lc[2.]: 赶鸭老爷爷，胡子白花花。唱呀唱着家乡戏，还会说笑话。
  ---
  N: 3 (10) 3 (10) | (33) (56) 6 - | 1e (55) 6 3 | (2^1^) (2^3^) 5 - | 1e (55) 6 3 | (2^1^) (2^3^) 1 - :||
  Lc[1.]: 咕嘎咕嘎，真呀真多鸭，数不清到底多%少%鸭，数不清到底多%少%鸭。
  Lc[2.]: 小孩小孩，快快上学校，别考个鸭蛋抱%回%家，别考个鸭蛋抱%回%家。`,
};
// const stave = {
//   body: [
//     {
//       // 一个小节
//       type: Bar,
//       notes: [{ note }, []],
//     },
//     {
//       // 一个小节
//     },
//     {
//       // 循环记号
//     },
//   ],
// };
